ESRA BARDAKCI

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Titanic_dataset.csv');data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

1.	Kazada ölenlerin yaş ortalamasını bulunuz

In [4]:
data[data['Survived']==0]['Age'].mean()

30.62617924528302

--------

2.	Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [5]:
data[data['Survived']==0]['Fare'].agg(['mean','median'])

mean      22.117887
median    10.500000
Name: Fare, dtype: float64

------

3.	Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [6]:
data[(data['Survived']==0)&(data['Sex']=='male')]['Age'].mean()

31.618055555555557

---------

4.	Kazada ölen Kadınların yaş ortalamasını bulunuz

In [7]:
data[(data['Survived']==0)&(data['Sex']=='female')]['Age'].mean()

25.046875

------

5.	Kazadan kurtulanların yaş ortalamasını bulunuz

In [8]:
data[data['Survived']==1]['Age'].mean()

28.343689655172415

-----------

6.	Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [9]:
data[data['Survived']==1]['Fare'].mean()

48.39540760233917

-----------

7.	Kazadan kurtulan toplam kişi sayısını bulunuz…

In [10]:
len(data[data['Survived']==1])

342

-----------------

8.	10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [11]:
data[data['Age']<10]['Fare'].median()

27.0

-------

9.	1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)

In [12]:
data.groupby('Pclass')['Fare'].agg(['mean','median'])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

------

10.	Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız.

In [13]:
data[data['Survived']==0]['Sex'].value_counts(normalize=True)

male      0.852459
female    0.147541
Name: Sex, dtype: float64

------